app/controllers/hero_powers_controller.rb

    def index
        hero_powers= HeroPower.all
---
SELECT "hero_powers".* FROM "hero_powers"

    def create
        hero_power = HeroPower.new(hero_power_params)
        if hero_power.save
---
INSERT INTO "hero_powers" ("strength", "hero_id", "power_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "Weak"], ["hero_id", 4], ["power_id", 6], ["created_at", "2023-03-25 09:32:07.686856"], ["updated_at", "2023-03-25 09:32:07.686856"]]