app/controllers/powers_controller.rb

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        power = Power.find_by(id: params[:id])

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "powers" SET "name" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["name", "Super Strength"], ["updated_at", "2023-03-25 08:56:34.852547"], ["id", 2]]
---
    def update
        power = Power.find_by(id: params[:id])

        if power
          if power.update(power_params)